<?php
/**
 * 核心提示，当前用户自登录请求开始，就记录session ID，并在以后的所有API交互中都提交session ID
 * 响应数据类型均为 JSON
 */

/**
 # 检查是否需要升级版本
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/api/version/check
# method 	: GET
# params	:
{
	"version" : "",	// 本地版本 标准版本写法 例 0.0.1
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"upload"	: "",		// 是否需要强制升级 0=不需要，1=需要
	"version"	: "",		// 最新版本，可以供客户端提醒用户可以升级到最新版本（非强制）
	"url"		: "",		// 最新版本下载地址
}

/**
 +
 +
 +
 +
 +
 +
 +
 +
 +
 +
*/


/**
 # 登录
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/user/login/dispatcher
# method 	: POST
# params	:
{
	"phone"		: "",	// 手机号
	"password"	: ""	// 账号密码
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"status"		: "",		// 验证状态 0=失败，1=成功
	"info"			: "",		// 提示，前端可以自行提示账号或者密码错误
	"departments"	: 			// 当前用户所属部门列表, 如果为空，则提示用户不属于任何部门
					[	
						{ "id"=>1, "name"=>"城西区营业厅" },
						# ...
					]
	}


/**
 # 登陆/选择部门
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/user/login/department
# method 	: POST
# params	: 
{
	"department":""	// 选中部门的ID
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"status"	: "",	// 响应状态 0=失败，1=成功   极小可能出现错误
	"info"		: "",	// 提示，前端可以自行提示不允许操作，并跳转到登陆界面
}

/**
 +
 +
 +
 +
 +
 +
 +
 +
 +
 +
*/


/**
 # LBS地图签到
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/sign/lbs/dispatcher
# method 	: POST
# params	: 
{
	"gid"		: "",	// 签到类型 1=上班打卡 2=下班打卡
	"lng"		: "",	// 地图定位 经度值
	"lat"		: "",	// 地图定位 纬度值
	"address"	: ""	// 地图地址名称
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"status"	: "",	// 响应状态 0=失败，1=成功   极小可能出现错误
	"info"		: "",	// 提示，前端可以自行提示签到失败
}

/**
 # 考勤记录列表
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/sign/lists
# method 	: POST
# params	: 
{
	"page"	: "",	// 请求的分页
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"count"		: "",	// 分页总量
	"page"		: "",	// 当前分页
	"list"		: 
				[
					{
						"id"		: "",	// 记录类型	
						"type"		: "",	// 打卡类型
						"tname"		: "",	// 打卡类型名称
						"gid"		: "",	// 签到类型 1=上班打卡 2=下班打卡
						"gname"		: "",	// 签到类型名称
						"signtime"	: "",	// 签到时间戳
						"address"	: "",	// 定位地址	[ LBS地图签到类型有效 ]
						"lng"		: "",	// 定位经度	[ LBS地图签到类型有效 ]
						"lat"		: "",	// 定位纬度	[ LBS地图签到类型有效 ]
					},
					# ...
				]
}

/**
 # 获取考勤申请子类
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/sign/application/ctype
# method 	: POST
# params	: 
{
	"type"	: "",	// 申请类型ID
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"list"	: 
			[
				{ "id"=>1, "name"=>"事假" },
				# ...
			]
}

/**
 # 考勤申请
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/sign/application/dispatcher
# method 	: POST
# params	: 
{
	"type"			: "",	// 申请分类
	"ctype"			: "",	// 申请子类
	"start_time"	: "",	// 开始时间戳
	"end_time"		: "",	// 结束时间戳
	"reason"		: "",	// 理由
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"status"	: "",		// 验证状态 0=失败，1=成功
	"info"		: "",		// 提示，前端可以自行提示账号或者密码错误
}

/**
 # 考勤申请列表
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/sign/application/lists
# method 	: POST
# params	: 
{
	"type"	: "",	// 申请类别
	"page"	: "",	// 请求的分页
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"count"		: "",	// 分页总量
	"page"		: "",	// 当前分页
	"list"		: 
				[
					{
						"id"			: "",	// 记录ID
						"ctype"			: "",	// 申请类型
						"ctype_name"	: "",	// 申请类型名称
						"start_time"	: "",	// 开始时间戳
						"end_time"		: "",	// 结束时间戳
						"reason"		: "",	// 理由
						"status"		: "",	// 0=等待批准 1=批准 -1=驳回
						"time"			: "",	// 申请时间戳
					},
					# ...
				]
}

/**
 +
 +
 +
 +
 +
 +
 +
 +
 +
 +
*/

/**
 # 获取可操作台账
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/financial/items/lists
# method 	: GET
# params	: {}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
[
	{
		"id"			: "",	// 记录ID
		"name"			: "",	// 名称
		"form_url"		: "",	// 表单地址
		"list_url"		: "",	// 列表地址
	},
	# ...
]

/**
=======
 # 获取已经提交台账列表
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/financial/submited/lists
# method 	: POST
# params	: 
{
	"item"	: "",	// 台账项类别
	"page"	: "",	// 请求的分页
}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
{
	"count"		: "",	// 分页总量
	"page"		: "",	// 当前分页
	"list"		: 
				[
					{
						"id"			: "",	// 记录ID
						"ctype"			: "",	// 申请类型
						"remark"		: "",	// 摘要（主显）
						"time"			: "",	// 申请时间戳
						"url"			: "",	// 详情url
					},
					# ...
				]
}


/**
 +
 +
 +
 +
 +
 +
 +
 +
 +
 +
*/

/**
 # 个人信息获取
 */
#-----------------------------------
# REQUEST
#-----------------------------------
# url		: http://域名/user/info/all
# method 	: GET
# params	: {}
#-----------------------------------
# RESPONSE
#-----------------------------------
# type		: JSON
# params	:
[
	"status"	: ""		// 状态 0=失败，1=成功， （ 非法操作|登陆状态失效 ）
	"info"		: 			// 信息
	{
		"id"			: "",		// 用户ID
		"username"		: "",		// 名称
		"phone"			: "",		// 手机号
		"mail"			: "",		// 电子邮箱
		"number"		: "",		// 工号
		"departments"	: 			// 当前用户所属部门列表, 如果为空，则提示用户不属于任何部门
						[	
							{ "id"=>1, "name"=>"城西区营业厅" },
							# ...
						]
	},
	# ...
]

